IDEA Open Model
HingeElement1D.HingeTypeZ Property
Compatible with IDEA StatiCa 20.1
 Hinge type in dirrection Z
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public HingeTypeInDirrection HingeTypeZ { get; set; }
Public Property HingeTypeZ As HingeTypeInDirrection
	Get
	Set
Property Value
Type: HingeTypeInDirrection
See Also
Reference
HingeElement1D Class
IdeaRS.OpenModel.Model Namespace